Revit 2027 API
UpdaterInfo Properties
The UpdaterInfo type exposes the following members.
Properties
Name | Description
AdditionalInformation |  Additional information about the updater.
ApplicationName |  Name of the application that owns the updater.
IsOptional |  Whether the updater is optional or not.
IsValidObject |  Specifies whether the .NET object represents a valid Revit entity.
UpdaterName |  Name of the updater.
Top
See Also
Reference
UpdaterInfo Class
Autodesk.Revit.DB Namespace